# Напишите программу, запрашивающую у пользователя его имя. В ответ
# на ввод на экране должно появиться приветствие с обращением по имени,
# введенному с клавиатуры ранее.

user_name = input('[~] Name: ')
print(f'[!] Hello, {user_name}!')